In [1]:
import numpy as np
import pandas as pd

In [2]:
data=pd.DataFrame([[1,2,3],[np.nan,4,5],[9,np.nan,8]])
data

     0    1  2
0  1.0  2.0  3
1  NaN  4.0  5
2  9.0  NaN  8

In [3]:
data.isnull()

       0      1      2
0  False  False  False
1   True  False  False
2  False   True  False

In [4]:
data.isnull().sum()

0    1
1    1
2    0
dtype: int64

In [5]:
data.isnull().sum().sum()

2

In [6]:
data.dropna()

     0    1  2
0  1.0  2.0  3

In [7]:
data.dropna(how='all')

     0    1  2
0  1.0  2.0  3
1  NaN  4.0  5
2  9.0  NaN  8

In [8]:
data.dropna(axis=1)

   2
0  3
1  5
2  8

In [9]:
data[0][0]=np.nan
data

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_10708\479375347.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data[0][0]=np.nan

     0    1  2
0  NaN  2.0  3
1  NaN  4.0  5
2  9.0  NaN  8

In [10]:
data.dropna(axis=1,how='all')

     0    1  2
0  NaN  2.0  3
1  NaN  4.0  5
2  9.0  NaN  8

In [11]:
data[1][1]=np.nan
data

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_10708\40966305.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data[1][1]=np.nan

     0    1  2
0  NaN  2.0  3
1  NaN  NaN  5
2  9.0  NaN  8

In [12]:
data.dropna(thresh=1)

     0    1  2
0  NaN  2.0  3
1  NaN  NaN  5
2  9.0  NaN  8

In [13]:
data.dropna(axis=1,thresh=2)

   2
0  3
1  5
2  8

### fillna

In [14]:
data.fillna(0)

     0    1  2
0  0.0  2.0  3
1  0.0  0.0  5
2  9.0  0.0  8

In [15]:
data

     0    1  2
0  NaN  2.0  3
1  NaN  NaN  5
2  9.0  NaN  8

In [16]:
data.fillna({0:-1})

     0    1  2
0 -1.0  2.0  3
1 -1.0  NaN  5
2  9.0  NaN  8

In [17]:
data

     0    1  2
0  NaN  2.0  3
1  NaN  NaN  5
2  9.0  NaN  8

In [18]:
data.fillna(method='ffill')

     0    1  2
0  NaN  2.0  3
1  NaN  2.0  5
2  9.0  2.0  8

In [19]:
data.fillna(method='bfill')

     0    1  2
0  9.0  2.0  3
1  9.0  NaN  5
2  9.0  NaN  8

In [20]:
data.fillna(method='bfill',limit=1)

     0    1  2
0  NaN  2.0  3
1  9.0  NaN  5
2  9.0  NaN  8

In [21]:
data.fillna(-1,limit=1)

     0    1  2
0 -1.0  2.0  3
1  NaN -1.0  5
2  9.0  NaN  8

In [22]:
data.fillna(data.mean())

     0    1  2
0  9.0  2.0  3
1  9.0  2.0  5
2  9.0  2.0  8

In [23]:
data

     0    1  2
0  NaN  2.0  3
1  NaN  NaN  5
2  9.0  NaN  8

### data transformation

In [24]:
d=pd.DataFrame([[1,2,3,3,1],[1,2,3,3,2]])

In [25]:
d

   0  1  2  3  4
0  1  2  3  3  1
1  1  2  3  3  2

In [26]:
d=d.T

In [27]:
d

   0  1
0  1  1
1  2  2
2  3  3
3  3  3
4  1  2

In [28]:
d.drop_duplicates()

   0  1
0  1  1
1  2  2
2  3  3
4  1  2

In [29]:
d.drop_duplicates([0])

   0  1
0  1  1
1  2  2
2  3  3

In [30]:
d

   0  1
0  1  1
1  2  2
2  3  3
3  3  3
4  1  2

In [31]:
d.drop_duplicates([0],keep='last')

   0  1
1  2  2
3  3  3
4  1  2

### replace

In [32]:
d

   0  1
0  1  1
1  2  2
2  3  3
3  3  3
4  1  2

In [33]:
data

     0    1  2
0  NaN  2.0  3
1  NaN  NaN  5
2  9.0  NaN  8

In [34]:
data.replace(9,np.nan)

    0    1  2
0 NaN  2.0  3
1 NaN  NaN  5
2 NaN  NaN  8

In [35]:
data

     0    1  2
0  NaN  2.0  3
1  NaN  NaN  5
2  9.0  NaN  8

In [36]:
data.replace(np.nan,0)

     0    1  2
0  0.0  2.0  3
1  0.0  0.0  5
2  9.0  0.0  8

In [37]:
d.replace([1,2],10)

    0   1
0  10  10
1  10  10
2   3   3
3   3   3
4  10  10

In [38]:
d.replace([1,2],[-1,-2])

   0  1
0 -1 -1
1 -2 -2
2  3  3
3  3  3
4 -1 -2

In [39]:
d.replace({1:-1,2:-2})

   0  1
0 -1 -1
1 -2 -2
2  3  3
3  3  3
4 -1 -2

### renaming axis

In [40]:
df=pd.DataFrame(np.arange(12).reshape(3,4))

In [41]:
df

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [42]:
data

     0    1  2
0  NaN  2.0  3
1  NaN  NaN  5
2  9.0  NaN  8

In [43]:
data.fillna({1:5,2:10})

     0    1  2
0  NaN  2.0  3
1  NaN  5.0  5
2  9.0  5.0  8

In [44]:
data[2][2]=np.nan

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_10708\1232264034.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data[2][2]=np.nan

In [45]:
data

     0    1    2
0  NaN  2.0  3.0
1  NaN  NaN  5.0
2  9.0  NaN  NaN

In [46]:
data.fillna({1:5,2:10})

     0    1     2
0  NaN  2.0   3.0
1  NaN  5.0   5.0
2  9.0  5.0  10.0

In [47]:
data.replace({1:5,2:10})

     0     1    2
0  NaN  10.0  3.0
1  NaN   NaN  5.0
2  9.0   NaN  NaN

In [48]:
data[1]=data[1].replace(np.nan,5)
data[2]=data[2].replace(np.nan,10)

In [49]:
data

     0    1     2
0  NaN  2.0   3.0
1  NaN  5.0   5.0
2  9.0  5.0  10.0

### renaming axis

In [50]:
df=pd.DataFrame(np.arange(12).reshape(3,4))

In [51]:
df

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [52]:
df.rename(columns={0:'A',1:'B',2:'C',3:'D'})

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11